app/views/static_pages/home.html.erb

                            <%= link_to user_path(g.user.id) do %>
                                <strong><%= g.user.first_name %> <%= g.user.last_name %> </strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]