app/views/gossip_rails_routes_form/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
                                        <%= link_to user_path(g.user.id) do %>
                                            <strong><%= g.user.first_name %> <%= g.user.last_name %> </strong>