app/controllers/gossip_rails_routes_form_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index

    @array = Gossip.all.to_a.each_slice(3).to_a

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show

    @user = User.find_by(id: Gossip.find_by(id: params['id'].to_i).user_id)

INSERT INTO "users" ("first_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["first_name", "dqsdqsd"], ["created_at", "2020-10-27 18:37:17.350323"], ["updated_at", "2020-10-27 18:37:17.350323"]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdfqsd"], ["content", "sdqsdqs"], ["user_id", 11], ["created_at", "2020-10-27 17:49:04.305360"], ["updated_at", "2020-10-27 17:49:04.305360"]]
INSERT INTO "users" ("first_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["first_name", "qsdqs"], ["created_at", "2020-10-27 17:48:36.744499"], ["updated_at", "2020-10-27 17:48:36.744499"]]
---
  def create

    @user_new = User.new(first_name: params['author'])
    @user_new.save
    @gossip_new = Gossip.new(title: params['title'],content: params['body'], user: @user_new)

    if @gossip_new.save