app/controllers/static_pages_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    @array = Gossip.all.to_a.each_slice(3).to_a

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def gossip
    @user = User.find_by(id: Gossip.find_by(id: params['id'].to_i).user_id)
    @gossip_content = Gossip.find_by(id: params['id'])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def user
    @user = User.find_by(id: params['id'].to_i)
    @city = City.find_by(id: @user.city_id.to_i)