app/controllers/user_controller.rb

    def show
        @user = User.find_by(id: params['id'].to_i)
        @city = City.find_by(id: @user.city_id.to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]